Revit 2024 API
StructuralConnectionHandler.SingleElementEndIndex Property
 Element end index for single element connections (0: start, 1: end).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public int SingleElementEndIndex { get; set; }
Visual Basic
Public Property SingleElementEndIndex As Integer
	Get
	Set
Visual C++
public:
property int SingleElementEndIndex {
	int get ();
	void set (int value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: singleElementEndIndex is not a valid end index.
See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace